[
    "Course Syllabus  Page 1",
    "CS2340.005 Course Syllabus",
    "________________________________________________________________",
    "Course Information",
    "CS2340.005    Computer Architecture",
    "Spring 2023",
    "________________________________________________________________",
    "Professor Contact Information",
    "Name John Cole",
    "Office Phone 972-883-6353",
    "Office Location Residence Hall West 2.401",
    "Email Address John.Cole@utdallas.edu",
    "Web Site www.utdallas.edu/~John.Cole",
    "Office Hours See Web site: https://personal.utdallas.edu/~John.Cole/#Office",
    "________________________________________________________________",
    "Course Modality and Expectations",
    "Instructional",
    "Mode",
    "1. In-person.  You will be expected to be in class.  Attendance is",
    "not mandatory but will be taken.  Classes will not be presented",
    "online unless the University requires it and will not be recorded",
    "unless the University requires it.",
    "Meeting Time",
    "and Place",
    "Monday/Wednesday from 1:00 to 2:15 PM",
    "Room: RH West 2.401",
    "Course",
    "Platform",
    "Traditional classroom.",
    "Expectations",
    "You will attend every class on time, participate when appropriate,",
    "and silence your phone and put it somewhere off the desk and out",
    "of reach.",
    "Asynchronous",
    "Learning",
    "Guidelines",
    "None.  Unless the University requires it, this class will not be",
    "offered asynchronously.",
    "General Course Information",
    "Prerequisites CS1337 and CS2305 with a grade of C or better.",
    "Course",
    "Description",
    "This course introduces the concepts of computer architecture by",
    "going through multiple levels of abstraction, and the numbering",
    "systems and their basic computations. It focuses on the instruction-",
    "set architecture of the MIPS machine, including MIPS assembly",
    "programming, translation between MIPS and C, and between MIPS",
    "Course Syllabus  Page 2",
    "and machine code. General topics include performance calculation,",
    "processor datapath, pipelining, and memory hierarchy.",
    "Learning",
    "Outcomes",
    "After successful completion of this course:",
    "1. Students should be able to convert numbers between bases",
    "2, 10, and 16 and perform binary 2’s complement arithmetic",
    "calculations.",
    "2. Students will create and debug Assembly language programs",
    "that include (a) integer operations, (b) floating-point",
    "operations, (c) control structures, (d) functions and macros,",
    "(e) static memory allocation for varied data types, (f) dynamic",
    "memory allocation, (g) standard I/O, and (h) memory-mapped",
    "I/O.",
    "3. Students will critique programs for efficient use of data types,",
    "addressing modes, and instructions, as well as for readability",
    "and maintainability using a provided rubric.",
    "4. Students will calculate computer performance measures.",
    "Students will use performance metrics to evaluate a chosen",
    "CPU architecture. Students will define terms used in CPU",
    "technical brochures.",
    "5. Students will differentiate between systems programs such as",
    "compilers, assemblers, linkers, and loaders, and explain how",
    "they are used by operating systems to convert programs into",
    "machine language to be executed.",
    "6. Students will explain the flow of information through a",
    "computer’s core components, including the datapath, control,",
    "memory, and I/O.",
    "7. Students will diagram the flow of data, code, and control",
    "signals through a pipelined architecture. Students will",
    "evaluate the presence or absence of hazards in a pipelined",
    "architecture, and explain how the hazards could be avoided.",
    "8. Students will diagram and explain the memory hierarchy,",
    "including caches and virtual memory. Students will explain the",
    "different memory technologies used in computers.",
    "9. Students will contrast the four types of parallelism.",
    "Required",
    "Text",
    "Computer Organization and Design - The Hardware/Software",
    "Interface – 6",
    "th",
    "Edition, Patterson and Hennessey, Morgan-Kaufmann,",
    "2013. ISBN-13: 978-0128201091. Note:  Make sure that you get the",
    "correct edition and processor (MIPS).",
    "Required",
    "Course",
    "Materials",
    "This course will involve coding in the MIPS assembly language using",
    "MARS (MIPS Assembler and Runtime Simulator). Get it free here:",
    "http://courses.missouristate.edu/KenVollmar/mars/",
    "Course Syllabus  Page 3",
    "The MARS simulator’s help screen is very useful.",
    "Course Policies",
    "Grading Criteria",
    "Major assignments  35%",
    "Tests (3) 60%",
    "Quizzes 5%",
    "Attendance: 0%",
    "A=93-100",
    "A-=90-92",
    "B+=87-89",
    "B=83-86",
    "B-=80-82",
    "C+=77-79",
    "C=73-76",
    "C-=70-72",
    "F=below 70",
    "Make-up Exams",
    "Not allowed except for documented serious medical reasons.  “I",
    "forgot to sign up with the testing center” is not a medical reason.",
    "Extra-Credit",
    "Work",
    "None given.  Please do not ask.",
    "Late Work",
    "Reduction of 25 percent per day or partial day for any late",
    "submissions unless otherwise stated in the assignment. That is,",
    "if the assignment is worth 100 points, you will lose 25 points per",
    "day, in addition to points lost because of the quality of work.",
    "Grade",
    "Information",
    "I do not curve individual assignments, but I may curve the entire",
    "course a little.  Do not count on this.  Do your best work.",
    "Grades will be posted in eLearning and you can use the weights",
    "above to see where you stand.",
    "Who Grades",
    "What",
    "Online quizzes are auto-graded by eLearning.  I grade tests and",
    "programs.",
    "Grade Disputes",
    "If you have an issue with your grade on a test or homework, talk",
    "to me.  You have one week after a grade is posted to do so.",
    "Do not come in at the end of the semester looking for a better",
    "grade on the first test.",
    "Online Quizzes",
    "You may be given quizzes in eLearning.  Often, these will be",
    "due before the lecture that covers the material.  The purpose is",
    "to get you to read the material before you hear it in class.  You",
    "may also be given in-class work to complete.  These may not be",
    "made up if you miss them, and late work is not accepted.",
    "________________________________________________________________",
    "Class Attendance",
    "The University’s attendance policy requirement is that individual faculty set their",
    "course attendance requirements. Computer Science Department policy is that if",
    "you miss three consecutive classes your grade will drop one letter grade.",
    "Missing four in a row is failing.",
    "Course Syllabus  Page 4",
    "Regular and punctual class attendance is expected regardless of modality.",
    "Students who fail to attend class regularly are inviting scholastic difficulty. In",
    "some courses, instructors may have special attendance requirements; these",
    "should be made known to students during the first week of classes. These",
    "attendance requirements will not be used as part of grading (see Class",
    "Participation below for grading information).",
    "Class Participation",
    "Regular class participation is expected regardless of course modality. Students",
    "who fail to participate in class regularly are inviting scholastic difficulty.",
    "Participation includes engaging in group or other activities during class that solicit",
    "your feedback on homework assignments, readings, or materials covered in the",
    "lectures (and/or labs). Class participation is documented by faculty.  Successful",
    "participation is defined as consistently adhering to University requirements, as",
    "presented in this syllabus. Failure to comply with these University requirements is",
    "a violation of the Student Code of Conduct.",
    "________________________________________________________________",
    "Class Recordings",
    "Students are expected to follow appropriate University policies and maintain the",
    "security of passwords used to access recorded lectures. Unless the Office of",
    "Student AccessAbility has approved the student to record the instruction,",
    "students are expressly prohibited from recording any part of this course.",
    "Recordings may not be published, reproduced, or shared with those not in the",
    "class, or uploaded to other online environments except to implement an",
    "approved Office of Student AccessAbility accommodation. Failure to comply with",
    "these University requirements is a violation of the Student Code of Conduct.",
    "NOTE: if the instructor records any part of the course, then the instructor",
    "will need to use the following syllabus statement:",
    "The instructor may record meetings of this course. Any recordings will be",
    "available to all students registered for this class as they are intended to",
    "supplement the classroom experience. Students are expected to follow",
    "appropriate University policies and maintain the security of passwords used to",
    "access recorded lectures. Unless the Office of Student AccessAbility has",
    "approved the student to record the instruction, students are expressly prohibited",
    "from recording any part of this course. Recordings may not be published,",
    "reproduced, or shared with those not in the class, or uploaded to other online",
    "environments except to implement an approved Office of Student AccessAbility",
    "accommodation. If the instructor or a UTD school/department/office plans any",
    "other uses for the recordings, consent of the students identifiable in the",
    "recordings is required prior to such use unless an exception is allowed by law.",
    "Failure to comply with these University requirements is a violation of the Student",
    "Code of Conduct.",
    "Course Syllabus  Page 5",
    "________________________________________________________________",
    "Class Materials",
    "The instructor may provide class materials that will be made available to all",
    "students registered for this class as they are intended to supplement the",
    "classroom experience. These materials may be downloaded during the course,",
    "however, these materials are for registered students' use only. Classroom",
    "materials may not be reproduced or shared with those not in class, or uploaded",
    "to other online environments except to implement an approved Office of Student",
    "AccessAbility accommodation. Failure to comply with these University",
    "requirements is a violation of the Student Code of Conduct.",
    "Tentative schedule of topics.  This is subject to change, and an updated version can",
    "be found at",
    "https://personal.utdallas.edu/~John.Cole/2022Fall/CS2340Fall2022Schedule.htm",
    "Week Date Topic Reading",
    "1",
    "Jan 18",
    "Syllabus and instructor Web site review",
    "Introduction to Computer Organization",
    "Syllabus from",
    "coursebook",
    "2",
    "Jan 23 Introduction to Computer Organization Ch. 1",
    "Jan 25 Introduction to Assembly Language Programming Appendix A",
    "3",
    "Jan 30",
    "Assembly Language Programming",
    "Performance evaluation, Amdahl's law",
    "Appendix A",
    "Ch. 1.6, 1.9",
    "Feb 1",
    "Data Representations: Binary, Hexadecimal, Octal",
    "Number Representations: signed, floating point",
    "Ch. 2.3",
    "Ch. 2.4",
    "4",
    "Feb 6 Addressing modes Ch. 2.10",
    "Feb 8",
    "Assembly operations: Load, Store, Add, Subtract,",
    "etc.",
    "Ch. 2.2",
    "5",
    "Feb 13 Instruction Representation; pseudo-instructions Ch. 2.5",
    "Feb 15 Comparing, Branching, Looping Ch. 2.7",
    "6",
    "Feb 20 Bit and byte manipulation, etc. Ch. 2.6",
    "Feb 22 Test 1 Review",
    "7",
    "Feb 27 Test 1",
    "Mar 1 Subroutines in Assembly Language Ch 2.8, A.6",
    "8",
    "Mar 6 Memory Allocation and the Heap Slides",
    "Mar 8 Addressing modes & System Software  Ch 2.12-13",
    "9",
    "Mar 13 Spring Break",
    "Mar 15 Spring Break",
    "Course Syllabus  Page 6",
    "10",
    "Mar 20 Integer Arithmetic Ch 3.1-3.4",
    "Mar 22 Floating Point Arithmetic Ch 3.5",
    "11",
    "Mar 27 Input & Output Ch. 4.9, A.7",
    "Mar 29 Interrupts and Exceptions CH. 4.10",
    "12",
    "Apr 3 Memory-mapped I/O Ch. A.8",
    "Apr 5 Test 2 Review",
    "13",
    "Apr 10 Test 2",
    "Apr 12",
    "Processor: Datapath & Control",
    "Processor: Pipelining",
    "Ch. 4.1-4.5",
    "14",
    "Apr 17 Processor: Pipelined Datapath Ch. 4.6-4.8",
    "Apr 19 Advanced Instruction Level Parallelism Ch. 4.11",
    "15",
    "Apr 24 Introduction to memory hierarchy Ch. 5.1-5.3",
    "Apr 26 Virtual memory Ch. 5.4-5.7s",
    "16",
    "May 1 Comparing ISAs Ch 2.16, 2.17",
    "May 3 Test 3 Review",
    "Test 3 -- TBA",
    "_______________________________________________________________",
    "Off-campus Instruction and Course Activities",
    "Not Applicable.",
    "________________________________________________________________",
    "Comet Creed",
    "This creed was voted on by the UT Dallas student body in 2014. It is a standard",
    "that Comets choose to live by and encourage others to do the same:",
    "“As a Comet, I pledge honesty, integrity, and service in all that I do.”",
    "________________________________________________________________",
    "Academic Support Resources",
    "The information contained in the following link lists the University’s academic",
    "support resources for all students.",
    "Please see http://go.utdallas.edu/academic-support-resources.",
    "________________________________________________________________",
    "UT Dallas Syllabus Policies and Procedures",
    "The information contained in the following link constitutes the University’s policies",
    "and procedures segment of the course syllabus.",
    "Course Syllabus  Page 7",
    "Please go to http://go.utdallas.edu/syllabus-policies for these policies.",
    "The descriptions and timelines contained in this syllabus are subject to change at",
    "the discretion of the Professor."
]